In [1]:
import pandas as pd
pd.__version__ , pd.__path__

('2.3.3',
 ['/Users/mbouderr/Library/Python/3.9/lib/python/site-packages/pandas'])

## modify rows and records in dataframe

In [2]:
data =  pd.read_csv('datasets/groupdata.csv')
data.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

In [3]:
data.shape

(16, 10)

In [4]:
data.index

RangeIndex(start=0, stop=16, step=1)

In [5]:
data.dtypes

roll no         object
name            object
age              int64
address         object
session         object
group           object
gender          object
subj1          float64
subj2          float64
scholarship    float64
dtype: object

In [6]:
data.columns

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

In [7]:
cat datasets/groupdatawithoutcollables.csv

MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000
MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000
MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500
MS04,Hadeed,20,Lahore,MOR,group A,Male,82,84.3,4000
MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500
MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,
MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,,4000
MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76,8000
MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500
MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800
MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000
MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,
MS13,Mujahid,18,Lahore,MORNING,group D,Male,,76.5,7000
MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76,8000
MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500
MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800

## add name of columns while reading the df

In [8]:
data = pd.read_csv('datasets/groupdatawithoutcollables.csv', names = ['roll no', 'name', 'age', 'address','session', 'group','gender','subj1', 'subj2', 'scholarship'] )
data.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [9]:
data =  pd.read_csv('datasets/groupdatawithoutcollables.csv', header = None)
data.head(3)

,0,1,2,3,4,5,6,7,8,9
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [10]:
data.columns = ['roll no', 'name', 'age', 'address','session', 'group','gender','subj1', 'subj2', 'scholarship']

In [11]:
data

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [12]:
data.columns

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

In [13]:
data.columns = data.columns.str.replace(' ' , '_' )

In [14]:
data

,roll_no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

### upper case lower case

In [15]:
list = [x.capitalize() for x in data.columns]
data.columns= list
data.head(5)

,Roll_no,Name,Age,Address,Session,Group,Gender,Subj1,Subj2,Scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

### rename

In [16]:
data = pd.read_csv('datasets/groupdata.csv')
data.rename(mapper={'roll no' : 'rollNo'},axis=1 ,inplace= True)
data.columns

Index(['rollNo', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

### change the marks of shaista

In [17]:
data.loc[data.name == 'Shaista', ['subj1', 'subj2']]

   subj1  subj2
2   64.9   75.1

In [18]:
data.loc[data.name == 'Shaista', ['subj1']] = [101]

# data.loc[data.name == 'Rauf',:]

### map function

In [19]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [20]:
  df['name'].map(len)

0     4
1     4
2     7
3     6
4     4
5     5
6     5
7     6
8     5
9     6
10    7
11    4
12    7
13    4
14    6
15    9
Name: name, dtype: int64

In [21]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [22]:
# def func(x):
    # if x <= 50:
    #     return 'Young'
    # else :
    #     return 'old'

df['Young/old'] =  data['age'].map(lambda x: 'young' if x <30 else 'old')
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship,Young/old
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0,old
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0,old
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0,old
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0,young
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0,old
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN,young
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0,old
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0,old
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0,old
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0,old
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0,old
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN,young
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0,young
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0,young
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0,old
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0,old

In [23]:
def func2(x):
    if x > 80 :
        return 'Pass'
    else :
        return 'Fail'
df['result'] = ((df['subj1']+df['subj2'])/2).map(func2)
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship,Young/old,result
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0,old,Pass
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0,old,Fail
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0,old,Fail
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0,young,Pass
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0,old,Fail

In [24]:
df = pd.read_csv('datasets/groupdata.csv')
df['session']= df['session'].map({'MORNING':'M','AFTERNOON':'A' })  
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,M,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,NaN,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,A,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,NaN,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,NaN,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,M,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,NaN,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,M,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,NaN,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,A,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,NaN,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,A,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,M,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,A,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,NaN,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,A,group A,Male,90.5,81.3,3800.0

### to avoid the Nan value on the other values  we use replace()

In [25]:
df =  pd.read_csv('datasets/groupdata.csv')
df['session'] =  df['session'].replace({'MORNING':'M','AFTERNOON':'A' })
df[['session']]

   session
0        M
1      AFT
2        A
3      MOR
4      AFT
5        M
6      AFT
7        M
8      AFT
9        A
10     MOR
11       A
12       M
13       A
14     AFT
15       A

### USE replace() on  entire dataframe

In [26]:
df =  pd.read_csv('datasets/groupdata.csv')
df.replace({'MORNING':'M','AFTERNOON':'AAAAA' })

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,M,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AAAAA,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,M,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,M,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AAAAA,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AAAAA,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,M,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AAAAA,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AAAAA,group A,Male,90.5,81.3,3800.0

### Apply

In [27]:
df =  pd.read_csv('datasets/groupdata.csv')
df['name'].apply(len)

0     4
1     4
2     7
3     6
4     4
5     5
6     5
7     6
8     5
9     6
10    7
11    4
12    7
13    4
14    6
15    9
Name: name, dtype: int64

In [28]:
# df['old/young']= df['age'].apply(lambda age : 'old' if age >30 else 'young')

df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [29]:
## tajriba nchoufo wach ymkn n7ezo chi bnt 3ndha >18 3am w mojtahidadf
df['mojtahida'] = df[['age','scholarship']].apply(lambda row: 'mojtahida' if (row['age'] > 18 )& (row['scholarship'] < 10000 ) else 'kassola', axis = 1)
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship,mojtahida
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0,mojtahida
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0,mojtahida
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0,mojtahida
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0,mojtahida
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0,mojtahida
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN,kassola
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0,mojtahida
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0,mojtahida
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0,mojtahida
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0,mojtahida
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0,mojtahida
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN,kassola
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0,kassola
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0,mojtahida
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0,mojtahida
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0,mojtahida

In [30]:
df['scholarship'] = df['scholarship'].replace({'NaN' : '15000'})

In [31]:
import pandas as pd
df =  pd.read_csv('datasets/groupdata.csv')
df.head(1)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0

In [32]:
newdf = pd.DataFrame(data=[['MS222',100,'london','AFT','group D','Male',55.55, 55.2, 99999]], columns = [ 'roll no' , 'age', 'address', 'session', 'group', 'gender','subj1', 'subj2', 'scholarship'])
newdf

  roll no  age address session    group gender  subj1  subj2  scholarship
0   MS222  100  london     AFT  group D   Male  55.55   55.2        99999

In [33]:
newdf = pd.DataFrame(data=[['charaf','MS222',100,'london','AFT','group D','Male',55.55, 55.2]],
columns = ['name', 'roll no' , 'age', 'address', 'session', 'group', 'gender','subj1', 'subj2'])
newdf

     name roll no  age address session    group gender  subj1  subj2
0  charaf   MS222  100  london     AFT  group D   Male  55.55   55.2

In [34]:
## append is deprecated  we can use concat
df =  pd.concat([df,newdf], ignore_index=True)
df.tail()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.10,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.50,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.50,81.3,3800.0
16,MS222,charaf,100,london,AFT,group D,Male,55.55,55.2,NaN

### drop a row

In [35]:
import pandas as pd
df =  pd.read_csv('datasets/groupdata.csv')
df.head(5)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

### drop  row 2  and row 4

In [36]:
df.drop(index=[2,4],axis =0, inplace = True)
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [37]:
dropIndex = df[df['session'] == 'AFT'].index
dropIndex

Index([1, 6, 8, 14], dtype='int64')

In [38]:
df.drop(index =  dropIndex , inplace = True)
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

### drop col with 2 Nan value

In [39]:
df.drop(df.columns[df.apply(lambda col : col.isnull().sum())], axis = 1 , inplace = True)

### change datatype

In [40]:
import pandas as pd
df =  pd.read_csv('datasets/groupdata.csv')
df.age.dtype

dtype('int64')

In [41]:
df['age'] =  df.age.astype(float)

In [42]:
df.age.dtype

dtype('float64')

In [43]:
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52.0,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51.0,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35.0,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20.0,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40.0,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16.0,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40.0,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51.0,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53.0,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38.0,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35.0,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25.0,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18.0,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28.0,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33.0,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42.0,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

### change str to bloean

In [44]:
df.gender.str.contains('Male')

0      True
1      True
2     False
3      True
4     False
5     False
6     False
7      True
8      True
9      True
10     True
11     True
12     True
13    False
14    False
15     True
Name: gender, dtype: bool

In [45]:
df.gender.str.contains('Male').astype(int)

0     1
1     1
2     0
3     1
4     0
5     0
6     0
7     1
8     1
9     1
10    1
11    1
12    1
13    0
14    0
15    1
Name: gender, dtype: int64

In [46]:
df['newGender'] = df.gender.str.contains('Male').astype(int)

In [47]:
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship,newGender
0,MS01,Rauf,52.0,Lahore,MORNING,group C,Male,78.3,84.4,5000.0,1
1,MS02,Arif,51.0,Islamabad,AFT,group A,Male,70.5,60.5,6000.0,1
2,MS03,Shaista,35.0,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0,0
3,MS04,Hadeed,20.0,Lahore,MOR,group A,Male,82.0,84.3,4000.0,1
4,MS05,Zara,40.0,Peshawer,AFT,group D,Female,65.9,72.8,3500.0,0
5,MS06,Mohid,16.0,Lahore,MORNING,group C,Female,69.3,78.6,NaN,0
6,MS07,Zobia,40.0,Sialkot,AFT,group B,Female,90.2,NaN,4000.0,0
7,MS08,Idrees,51.0,Multan,MORNING,group D,Male,84.1,76.0,8000.0,1
8,MS09,Jamil,53.0,Karachi,AFT,group C,Male,90.5,81.3,3500.0,1
9,MS10,Shahid,38.0,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0,1
10,MS11,Khurram,35.0,Islamabad,MOR,group B,Male,90.5,81.3,6000.0,1
11,MS12,Maaz,25.0,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN,1
12,MS13,Mujahid,18.0,Lahore,MORNING,group D,Male,NaN,76.5,7000.0,1
13,MS14,Sara,28.0,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0,0
14,MS15,Fatima,33.0,Sialkot,AFT,group C,Female,90.5,81.3,3500.0,0
15,MS16,Kakamanna,42.0,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0,1

## sort a df using sort_values

In [56]:
import pandas as pd
df =  pd.read_csv('datasets/groupdata.csv')
df1 =  df.sort_values(by=['age', 'scholarship'],ascending=[True,False]).reset_index()

In [57]:
df1.head(5)

,index,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
1,12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
2,3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
3,11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
4,13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

### sort value Nan value

In [61]:
import pandas as pd
df =  pd.read_csv('datasets/groupdata.csv')
df.sort_values(by=['scholarship'], na_position='last')

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN

### sort using sort_index()

In [71]:
df.sort_index()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0